{"config": [{"config": {"init": "glorot_uniform", "W_regularizer": null, "input_dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "trainable": true, "b_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 32, "border_mode": "same", "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_13", "nb_col": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_19"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "W_regularizer": null, "nb_row": 3, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 32, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "name": "convolution2d_14", "nb_col": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_20"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_7", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_10", "p": 0.25}, "class_name": "Dropout"}, {"config": {"border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "name": "convolution2d_15", "nb_col": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_21"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "W_regularizer": null, "nb_row": 3, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "name": "convolution2d_16", "nb_col": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_22"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_8", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_11", "p": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_4"}, "class_name": "Flatten"}, {"config": {"output_dim": 512, "W_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_7", "activation": "linear", "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_23"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_12", "p": 0.8}, "class_name": "Dropout"}, {"config": {"output_dim": 43, "W_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "activity_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_8", "activation": "linear", "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_24"}, "class_name": "Activation"}], "keras_version": "1.1.0", "class_name": "Sequential"}